<?php

    $flag = 1;

    if($flag == 1){
        echo "{".
            "\"code\": \"1111\",".
            "\"data\": \"\",".
            "\"msg\": \"还没有评分\"".
        "}";
    }elseif($flag == 2){
        echo "{".
            "\"code\": \"2222\",".
            "\"data\": \"\",".
            "\"msg\": \"芝麻信用评分不足\"".
        "}";
    }elseif($flag == 3){
        echo "{".
            "\"code\": \"2222\",".
            "\"data\": \"\",".
            "\"msg\": \"信用额度小于订单金额\"".
        "}";
    }elseif($flag == 4){
         echo "{".
             "\"code\": \"0000\",".
             "\"data\": \"5000\",".
             "\"msg\": \"评分审核通过\"".
         "}";
     }

?>