<?php

    $flag = 1;

    if($flag == 1){
        echo "{".
            "\"code\": \"2000\",".
            "\"data\": \"\",".
            "\"msg\": \"您的姓名/身份证号不一致，请核对后重新填写\"".
        "}";
    }elseif($flag == 2){
        echo "{".
            "\"code\": \"2000\",".
            "\"data\": \"81\",".
            "\"msg\": \"同盾>80分\"".
        "}";
    }elseif($flag == 3){
        echo "{".
            "\"code\": \"0000\",".
            "\"data\": \"http://m.jd.com/\",".
            "\"msg\": \"请求成功\"".
        "}";
    }

?>